PinguinoIDE/pinguino-compilers/linux32/p8/share/gputils/header/p16lf1773.inc
G3DBR0           EQU  H'0000'
G3DBR1           EQU  H'0001'
G3DBR2           EQU  H'0002'
G3DBR3           EQU  H'0003'
G3DBR4           EQU  H'0004'
G3DBR5           EQU  H'0005'


;----- COG3DBF Bits -----------------------------------------------------
DBF0             EQU  H'0000'
DBF1             EQU  H'0001'
DBF2             EQU  H'0002'
DBF3             EQU  H'0003'
DBF4             EQU  H'0004'
DBF5             EQU  H'0005'

G3DBF0           EQU  H'0000'
G3DBF1           EQU  H'0001'
G3DBF2           EQU  H'0002'
G3DBF3           EQU  H'0003'
G3DBF4           EQU  H'0004'
G3DBF5           EQU  H'0005'



;----- COG3CON0 Bits -----------------------------------------------------
LD               EQU  H'0006'
EN               EQU  H'0007'

MD0              EQU  H'0000'
MD1              EQU  H'0001'
MD2              EQU  H'0002'
CS0_COG3CON0     EQU  H'0003'
CS1_COG3CON0     EQU  H'0004'

G3LD             EQU  H'0006'
G3EN             EQU  H'0007'

G3MD0            EQU  H'0000'
G3MD1            EQU  H'0001'
G3MD2            EQU  H'0002'
G3CS0            EQU  H'0003'
G3CS1            EQU  H'0004'


;----- COG3CON1 Bits -----------------------------------------------------
POLA             EQU  H'0000'
POLB             EQU  H'0001'
POLC             EQU  H'0002'
POLD             EQU  H'0003'
FDBS             EQU  H'0006'
RDBS             EQU  H'0007'

G3POLA           EQU  H'0000'
G3POLB           EQU  H'0001'
G3POLC           EQU  H'0002'
G3POLD           EQU  H'0003'
G3FDBS           EQU  H'0006'
G3RDBS           EQU  H'0007'


;----- COG3RIS0 Bits -----------------------------------------------------
RIS0             EQU  H'0000'
RIS1             EQU  H'0001'
RIS2             EQU  H'0002'
RIS3             EQU  H'0003'
RIS4             EQU  H'0004'
RIS5             EQU  H'0005'
RIS6             EQU  H'0006'
RIS7             EQU  H'0007'

G3RIS0           EQU  H'0000'
G3RIS1           EQU  H'0001'
G3RIS2           EQU  H'0002'
G3RIS3           EQU  H'0003'
G3RIS4           EQU  H'0004'
G3RIS5           EQU  H'0005'
G3RIS6           EQU  H'0006'
G3RIS7           EQU  H'0007'


;----- COG3RIS1 Bits -----------------------------------------------------
RIS9             EQU  H'0001'
RIS11            EQU  H'0003'
RIS12            EQU  H'0004'
RIS13            EQU  H'0005'
RIS14            EQU  H'0006'
RIS15            EQU  H'0007'

G3RIS9           EQU  H'0001'
G3RIS11          EQU  H'0003'
G3RIS12          EQU  H'0004'
G3RIS13          EQU  H'0005'
G3RIS14          EQU  H'0006'
G3RIS15          EQU  H'0007'


;----- COG3RSIM0 Bits -----------------------------------------------------
RSIM0            EQU  H'0000'
RSIM1            EQU  H'0001'
RSIM2            EQU  H'0002'
RSIM3            EQU  H'0003'
RSIM4            EQU  H'0004'
RSIM5            EQU  H'0005'
RSIM6            EQU  H'0006'
RSIM7            EQU  H'0007'

G3RSIM0          EQU  H'0000'
G3RSIM1          EQU  H'0001'
G3RSIM2          EQU  H'0002'
G3RSIM3          EQU  H'0003'
G3RSIM4          EQU  H'0004'
G3RSIM5          EQU  H'0005'
G3RSIM6          EQU  H'0006'
G3RSIM7          EQU  H'0007'


;----- COG3RSIM1 Bits -----------------------------------------------------
RSIM9            EQU  H'0001'
RSIM11           EQU  H'0003'
RSIM12           EQU  H'0004'
RSIM13           EQU  H'0005'
RSIM14           EQU  H'0006'
RSIM15           EQU  H'0007'

G3RSIM9          EQU  H'0001'
G3RSIM11         EQU  H'0003'
G3RSIM12         EQU  H'0004'
G3RSIM13         EQU  H'0005'
G3RSIM14         EQU  H'0006'
G3RSIM15         EQU  H'0007'


;----- COG3FIS0 Bits -----------------------------------------------------
FIS0             EQU  H'0000'
FIS1             EQU  H'0001'
FIS2             EQU  H'0002'
FIS3             EQU  H'0003'
FIS4             EQU  H'0004'
FIS5             EQU  H'0005'
FIS6             EQU  H'0006'
FIS7             EQU  H'0007'

G3FIS0           EQU  H'0000'
G3FIS1           EQU  H'0001'
G3FIS2           EQU  H'0002'
G3FIS3           EQU  H'0003'
G3FIS4           EQU  H'0004'
G3FIS5           EQU  H'0005'
G3FIS6           EQU  H'0006'
G3FIS7           EQU  H'0007'


;----- COG3FIS1 Bits -----------------------------------------------------
FIS9             EQU  H'0001'
FIS11            EQU  H'0003'
FIS12            EQU  H'0004'
FIS13            EQU  H'0005'
FIS14            EQU  H'0006'
FIS15            EQU  H'0007'

G3FIS9           EQU  H'0001'
G3FIS11          EQU  H'0003'
G3FIS12          EQU  H'0004'
G3FIS13          EQU  H'0005'
G3FIS14          EQU  H'0006'
G3FIS15          EQU  H'0007'


;----- COG3FSIM0 Bits -----------------------------------------------------
FSIM0            EQU  H'0000'
FSIM1            EQU  H'0001'
FSIM2            EQU  H'0002'
FSIM3            EQU  H'0003'
FSIM4            EQU  H'0004'
FSIM5            EQU  H'0005'
FSIM6            EQU  H'0006'
FSIM7            EQU  H'0007'

G3FSIM0          EQU  H'0000'
G3FSIM1          EQU  H'0001'
G3FSIM2          EQU  H'0002'
G3FSIM3          EQU  H'0003'
G3FSIM4          EQU  H'0004'
G3FSIM5          EQU  H'0005'
G3FSIM6          EQU  H'0006'
G3FSIM7          EQU  H'0007'


;----- COG3FSIM1 Bits -----------------------------------------------------
FSIM9            EQU  H'0001'
FSIM11           EQU  H'0003'
FSIM12           EQU  H'0004'
FSIM13           EQU  H'0005'
FSIM14           EQU  H'0006'
FSIM15           EQU  H'0007'

G3FSIM9          EQU  H'0001'
G3FSIM11         EQU  H'0003'
G3FSIM12         EQU  H'0004'
G3FSIM13         EQU  H'0005'
G3FSIM14         EQU  H'0006'
G3FSIM15         EQU  H'0007'


;----- COG3ASD0 Bits -----------------------------------------------------
ASREN            EQU  H'0006'
ASE              EQU  H'0007'

ASDAC0           EQU  H'0002'
ASDAC1           EQU  H'0003'
ASDBD0           EQU  H'0004'
ASDBD1           EQU  H'0005'
ARSEN            EQU  H'0006'

G3ARSEN          EQU  H'0006'
G3ASE            EQU  H'0007'

G3ASDAC0         EQU  H'0002'
G3ASDAC1         EQU  H'0003'
G3ASDBD0         EQU  H'0004'
G3ASDBD1         EQU  H'0005'
G3ASREN          EQU  H'0006'


;----- COG3ASD1 Bits -----------------------------------------------------
AS0E             EQU  H'0000'
AS1E             EQU  H'0001'
AS2E             EQU  H'0002'
AS3E             EQU  H'0003'
AS4E             EQU  H'0004'
AS5E             EQU  H'0005'
AS6E             EQU  H'0006'
AS7E             EQU  H'0007'

G3AS0E           EQU  H'0000'
G3AS1E           EQU  H'0001'
G3AS2E           EQU  H'0002'
G3AS3E           EQU  H'0003'
G3AS4E           EQU  H'0004'
G3AS5E           EQU  H'0005'
G3AS6E           EQU  H'0006'
G3AS7E           EQU  H'0007'


